--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/tom/Documents/GitHub/ivonesamplemr/cscripts/install.log
  log type:  text
 opened on:  17 Sep 2021, 20:41:22

. 
. ** net install
. 
. cap noi ado uninstall ivonesamplemr
package not found

. 
. net desc ivonesamplemr, from("https://raw.github.com/remlapmot/ivonesamplemr/m
> ain/")

--------------------------------------------------------------------------------
package ivonesamplemr from https://raw.github.com/remlapmot/ivonesamplemr/main
--------------------------------------------------------------------------------

TITLE
      ivonesamplemr

DESCRIPTION/AUTHOR(S)
      Author: Tom Palmer
      Distribution-Date: 20210917

INSTALLATION FILES                        (type net install ivonesamplemr)
      iv.ado
      iv.sthlp
      ivasmm.sthlp
      ivlsmm.ado
      ivlsmm.sthlp
      ivmsmm.ado
      ivmsmm.sthlp
      ivmw.ado
      ivmw.sthlp
      ivonesamplemr.sthlp
      ivonesamplemr-author.ihlp
      ivtsps.ado
      ivtsps.sthlp
      ivtsri.ado
      ivtsri.sthlp
      ivxtile.ado
      ivxtile.sthlp
--------------------------------------------------------------------------------

. 
. net install ivonesamplemr, from("https://raw.github.com/remlapmot/ivonesamplem
> r/main/") replace
checking ivonesamplemr consistency and verifying not already installed...
installing into /Users/tom/Library/Application Support/Stata/ado/plus/...
installation complete.

. do https://raw.github.com/remlapmot/ivonesamplemr/main/dependency.do

. // dependencies for ivonesamplemr package
. // Tom Palmer 2021-09-04
. 
. foreach prog in ivpois ivreg2 ranktest {
  2.     // note: ranktest is a dependency of ivreg2
.         cap noi ssc install `prog'
  3.         if _rc == 602 {
  4.                 di as txt "Installing the latest version of `prog'"
  5.                 ssc install `prog', replace
  6.         }
  7. }
checking ivpois consistency and verifying not already installed...
all files already exist and are up to date.
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.
checking ranktest consistency and verifying not already installed...
all files already exist and are up to date.

. 
end of do-file

. 
. ** github package
. 
. cap noi ado uninstall ivonesamplemr

package ivonesamplemr from https://raw.github.com/remlapmot/ivonesamplemr/main
      ivonesamplemr

(package uninstalled)

. 
. net install github, from("https://haghish.github.io/github/")
checking github consistency and verifying not already installed...
all files already exist and are up to date.

. github install remlapmot/ivonesamplemr
checking ivonesamplemr consistency and verifying not already installed...
installing into /Users/tom/Library/Application Support/Stata/ado/plus/...
installation complete.

Checking package dependencies
installing ivonesamplemr package dependencies:


. // dependencies for ivonesamplemr package
. // Tom Palmer 2021-09-04
. 
. foreach prog in ivpois ivreg2 ranktest {
  2.     // note: ranktest is a dependency of ivreg2
.         cap noi ssc install `prog'
  3.         if _rc == 602 {
  4.                 di as txt "Installing the latest version of `prog'"
  5.                 ssc install `prog', replace
  6.         }
  7. }
checking ivpois consistency and verifying not already installed...
all files already exist and are up to date.
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.
checking ranktest consistency and verifying not already installed...
all files already exist and are up to date.

. 
end of do-file

. 
. cap noi ado uninstall ivonesamplemr

package ivonesamplemr from https://raw.githubusercontent.com/remlapmot/ivonesamp
> lemr/master
      ivonesamplemr

(package uninstalled)

. 
. log close
      name:  <unnamed>
       log:  /Users/tom/Documents/GitHub/ivonesamplemr/cscripts/install.log
  log type:  text
 closed on:  17 Sep 2021, 20:42:22
--------------------------------------------------------------------------------
