-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\tom\Documents\GitHub\ivonesamplemr\cscripts\install.log
  log type:  text
 opened on:  21 Aug 2023, 21:35:28

. 
. about

Stata/MP 17.0 for Windows (64-bit x86-64)
Revision 18 Jul 2023
Copyright 1985-2021 StataCorp LLC

Total physical memory:       32.00 GB
Available physical memory:   18.61 GB

Stata license: Unlimited-user 2-core network, expiring 21 Jan 2024
Serial number: 501709378202
  Licensed to: Tom Palmer
               University of Bristol

. 
. ** net install
. 
. cap noi ado uninstall ivonesamplemr
package not found

. 
. net desc ivonesamplemr, from("https://raw.github.com/remlapmot/ivonesamplemr/
> main/")

-------------------------------------------------------------------------------
package ivonesamplemr from https://raw.github.com/remlapmot/ivonesamplemr/main
-------------------------------------------------------------------------------

TITLE
      ivonesamplemr

DESCRIPTION/AUTHOR(S)
      Author: Tom Palmer
      Distribution-Date: 20210927

INSTALLATION FILES                        (type net install ivonesamplemr)
      iv.ado
      iv.sthlp
      ivasmm.sthlp
      ivlsmm.ado
      ivlsmm.sthlp
      ivmsmm.ado
      ivmsmm.sthlp
      ivmw.ado
      ivmw.sthlp
      ivonesamplemr.sthlp
      ivonesamplemr-author.ihlp
      ivtsps.ado
      ivtsps.sthlp
      ivtsri.ado
      ivtsri.sthlp
      ivxtile.ado
      ivxtile.sthlp
-------------------------------------------------------------------------------

. 
. net install ivonesamplemr, from("https://raw.github.com/remlapmot/ivonesample
> mr/main/") replace
checking ivonesamplemr consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

. do https://raw.github.com/remlapmot/ivonesamplemr/main/dependency.do

. // dependencies for ivonesamplemr package
. // Tom Palmer 2021-09-04
. 
. foreach prog in ivpois ivreg2 ranktest {
  2.     // note: ranktest is a dependency of ivreg2
.         cap noi ssc install `prog'
  3.         if _rc == 602 {
  4.                 di as txt "Installing the latest version of `prog'"
  5.                 ssc install `prog', replace
  6.         }
  7. }
checking ivpois consistency and verifying not already installed...
all files already exist and are up to date.
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.
checking ranktest consistency and verifying not already installed...
all files already exist and are up to date.

. 
end of do-file

. 
. ** github package
. 
. cap noi ado uninstall ivonesamplemr

package ivonesamplemr from https://raw.github.com/remlapmot/ivonesamplemr/main
      ivonesamplemr

(package uninstalled)

. 
. net install github, from("https://haghish.github.io/github/")
checking github consistency and verifying not already installed...
all files already exist and are up to date.

. github install remlapmot/ivonesamplemr
checking ivonesamplemr consistency and verifying not already installed...
installing into c:\ado\plus\...
installation complete.

Checking package dependencies
installing ivonesamplemr package dependencies:


. // dependencies for ivonesamplemr package
. // Tom Palmer 2021-09-04
. 
. foreach prog in ivpois ivreg2 ranktest {
  2.     // note: ranktest is a dependency of ivreg2
.         cap noi ssc install `prog'
  3.         if _rc == 602 {
  4.                 di as txt "Installing the latest version of `prog'"
  5.                 ssc install `prog', replace
  6.         }
  7. }
checking ivpois consistency and verifying not already installed...
all files already exist and are up to date.
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.
checking ranktest consistency and verifying not already installed...
all files already exist and are up to date.

. 
end of do-file

. 
. cap noi ado uninstall ivonesamplemr

package ivonesamplemr from https://raw.githubusercontent.com/remlapmot/ivonesam
> plemr/master
      ivonesamplemr

(package uninstalled)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\tom\Documents\GitHub\ivonesamplemr\cscripts\install.log
  log type:  text
 closed on:  21 Aug 2023, 21:36:17
-------------------------------------------------------------------------------
