-------------------------------------------------------------------------------
      name:  ivtsri
       log:  /Users/tom/Documents/GitHub/onesamplemr-stata/cscripts/ivtsri.log
  log type:  text
 opened on:  10 Sep 2021, 08:19:54

. // ivtsri cscript
. // 2021-09-06
. 
. cscript ivtsri adofiles ivtsri
-------------------------------------------------------------------BEGIN ivtsri

-> which ivtsri, usesysdir
/Users/tom/Documents/GitHub/onesamplemr-stata/ivtsri.ado
*! 1.0.0 Tom Palmer 05sep2021

. 
. // simulate data
. clear

. set obs 2500
number of observations (_N) was 0, now 2,500

. set seed 12345

. gen z1 = rbinomial(2, .2)

. gen z2 = rbinomial(2, .3)

. gen z3 = rbinomial(2, .4)

. gen u = rnormal()

. gen w = rnormal()

. gen x = z1 + z2 + z3 + w + u + rnormal()

. gen logitpy = -2 + x + w + u

. gen py = invlogit(logitpy)

. gen y = rbinomial(1, py)

. gen x1 = x

. gen x2 = rnormal()

. 
. // tests
. 
. // identity link
. 
. ivtsri y (x = z1 z2 z3)

Final GMM criterion Q(b) =  3.73e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b2 |   .0740544    .009023     8.21   0.000     .0563696    .0917393
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

Causal risk difference for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0740544    .009023     8.21   0.000     .0563696    .0917393
------------------------------------------------------------------------------

. ivtsri

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b2 |   .0740544    .009023     8.21   0.000     .0563696    .0917393
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

Causal risk difference for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0740544    .009023     8.21   0.000     .0563696    .0917393
------------------------------------------------------------------------------

. 
. ivtsri y (x = z1 z2 z3) if _n <= 50

Final GMM criterion Q(b) =  1.81e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =         50
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   1.060589   .3962486     2.68   0.007     .2839558    1.837222
    /s1xb_z2 |   1.148148   .3925519     2.92   0.003     .3787603    1.917535
    /s1xb_z3 |   1.403546   .3177779     4.42   0.000      .780713    2.026379
         /a0 |  -.5013724   .3595452    -1.39   0.163    -1.206068    .2033233
         /b1 |      .1713   .0290798     5.89   0.000     .1143046    .2282954
         /b2 |   .0036814    .039025     0.09   0.925    -.0728061    .0801689
         /b0 |   .2434077   .0653369     3.73   0.000     .1153498    .3714656
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |      .1713   .0290798     5.89   0.000     .1143046    .2282954
------------------------------------------------------------------------------

Causal risk difference for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0036814    .039025     0.09   0.925    -.0728061    .0801689
------------------------------------------------------------------------------

. 
. ivtsri y (x = z1 z2 z3), link(identity)

Final GMM criterion Q(b) =  3.73e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b2 |   .0740544    .009023     8.21   0.000     .0563696    .0917393
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

Causal risk difference for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0740544    .009023     8.21   0.000     .0563696    .0917393
------------------------------------------------------------------------------

. 
. ivtsri y w (x = z1 z2 z3), link(identity)

Final GMM criterion Q(b) =  4.63e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   9
Number of moments    =   9
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .1052528   .0073427    14.33   0.000     .0908613    .1196442
         /b2 |   .0545595   .0092853     5.88   0.000     .0363606    .0727584
 /s2exogxb_w |   .1160821   .0105911    10.96   0.000     .0953239    .1368403
         /b0 |   .2867508   .0150764    19.02   0.000     .2572016       .3163
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: x __000004 w _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1052528   .0073427    14.33   0.000     .0908613    .1196442
------------------------------------------------------------------------------

Causal risk difference for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0545595   .0092853     5.88   0.000     .0363606    .0727584
------------------------------------------------------------------------------

. 
. ivtsri y (x = z1 z2 z3), estonly

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .1070019   .0072277    14.80   0.000      .092829    .1211749
    __000004 |   .0740544   .0084664     8.75   0.000     .0574525    .0906564
       _cons |   .2879917   .0151852    18.97   0.000     .2582148    .3177685
------------------------------------------------------------------------------

. ivtsri

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .1070019   .0072277    14.80   0.000      .092829    .1211749
    __000004 |   .0740544   .0084664     8.75   0.000     .0574525    .0906564
       _cons |   .2879917   .0151852    18.97   0.000     .2582148    .3177685
------------------------------------------------------------------------------

. 
. // logadd link
. 
. cap noi {
. ivtsri y (x = z1 z2 z3), link(logadd)

Final GMM criterion Q(b) =  6.95e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |    .204947   .0167534    12.23   0.000     .1721109    .2377831
         /b2 |   .1651491   .0197853     8.35   0.000     .1263706    .2039275
         /b0 |  -1.326536   .0446685   -29.70   0.000    -1.414084   -1.238987
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.22746   .0205641    12.23   0.000      1.18781    1.268434
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.179569   .0233381     8.35   0.000     1.134703    1.226209
------------------------------------------------------------------------------
. ivtsri

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |    .204947   .0167534    12.23   0.000     .1721109    .2377831
         /b2 |   .1651491   .0197853     8.35   0.000     .1263706    .2039275
         /b0 |  -1.326536   .0446685   -29.70   0.000    -1.414084   -1.238987
------------------------------------------------------------------------------

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.22746   .0205641    12.23   0.000      1.18781    1.268434
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.179569   .0233381     8.35   0.000     1.134703    1.226209
------------------------------------------------------------------------------
. 
. ivtsri y (x = z1 z2 z3) if _n <= 200, link(logadd)

Final GMM criterion Q(b) =  8.12e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =        200
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |    .960665   .1863621     5.15   0.000      .595402    1.325928
    /s1xb_z2 |   1.017943   .1993872     5.11   0.000     .6271518    1.408735
    /s1xb_z3 |   1.105939   .1977604     5.59   0.000     .7183356    1.493542
         /a0 |  -.1036275   .2498245    -0.41   0.678    -.5932745    .3860195
         /b1 |   .2241425   .0467658     4.79   0.000     .1324832    .3158019
         /b2 |   .1423872   .0539735     2.64   0.008      .036601    .2481733
         /b0 |  -1.260957   .1392786    -9.05   0.000    -1.533938    -.987976
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.251249   .0585157     4.79   0.000      1.14166    1.371359
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.153023   .0622327     2.64   0.008     1.037279    1.281682
------------------------------------------------------------------------------
. 
. ivtsri y w (x = z1 z2 z3), link(logadd)

Final GMM criterion Q(b) =  3.27e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   9
Number of moments    =   9
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .2005151   .0166767    12.02   0.000     .1678294    .2332007
         /b2 |   .1272374   .0204528     6.22   0.000     .0871507    .1673241
 /s2exogxb_w |   .2483674   .0243529    10.20   0.000     .2006365    .2960982
         /b0 |  -1.332769   .0428083   -31.13   0.000    -1.416671   -1.248866
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: x __000004 w _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.222032   .0203794    12.02   0.000     1.182735    1.262635
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.135687    .023228     6.22   0.000     1.091061    1.182137
------------------------------------------------------------------------------
. 
. ivtsri y (x = z1 z2 z3), link(logadd) estonly

------------------------------------------------------------------------------
             |                 OIM
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |    .204947   .0264587     7.75   0.000      .153089     .256805
    __000004 |   .1651491   .0316964     5.21   0.000     .1030253    .2272729
       _cons |  -1.326536   .0639398   -20.75   0.000    -1.451855   -1.201216
------------------------------------------------------------------------------
. ivtsri

------------------------------------------------------------------------------
             |                 OIM
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |    .204947   .0264587     7.75   0.000      .153089     .256805
    __000004 |   .1651491   .0316964     5.21   0.000     .1030253    .2272729
       _cons |  -1.326536   .0639398   -20.75   0.000    -1.451855   -1.201216
------------------------------------------------------------------------------
. }

. 
. // logmult link
. 
. cap noi {
. ivtsri y (x = z1 z2 z3), link(logmult)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered

Final GMM criterion Q(b) =  3.58e-33
convergence not achieved
    The Gauss-Newton stopping criterion has been met but missing standard
    errors indicate some of the parameters are not identified.

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .4135643          .        .       .            .           .
         /b2 |   .3386225          .        .       .            .           .
         /b0 |   34.85623          .        .       .            .           .
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons
Warning: convergence not achieved

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.512198          .        .       .            .           .
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.403014          .        .       .            .           .
------------------------------------------------------------------------------
. ivtsri

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .4135643          .        .       .            .           .
         /b2 |   .3386225          .        .       .            .           .
         /b0 |   34.85623          .        .       .            .           .
------------------------------------------------------------------------------

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.512198          .        .       .            .           .
------------------------------------------------------------------------------

Causal risk ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.403014          .        .       .            .           .
------------------------------------------------------------------------------
. 
. ivtsri y (x = z1 z2 z3) if _n <= 250, link(logmult)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Hessian is not positive semidefinite
r(430);
. 
. ivtsri y w (x = z1 z2 z3), link(logmult)
. 
. ivtsri y (x = z1 z2 z3), link(logmult) estonly
. ivtsri
. }

. 
. // logit link
. 
. ivtsri y (x = z1 z2 z3), link(logit)

Final GMM criterion Q(b) =  3.97e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .8518266   .0648163    13.14   0.000      .724789    .9788641
         /b2 |   .5726491   .0694512     8.25   0.000     .4365273    .7087709
         /b0 |  -1.675875    .133441   -12.56   0.000    -1.937415   -1.414336
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.343924   .1519244    13.14   0.000     2.064296    2.661431
------------------------------------------------------------------------------

Causal odds ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.772958    .123134     8.25   0.000     1.547325    2.031493
------------------------------------------------------------------------------

. ivtsri

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .8518266   .0648163    13.14   0.000      .724789    .9788641
         /b2 |   .5726491   .0694512     8.25   0.000     .4365273    .7087709
         /b0 |  -1.675875    .133441   -12.56   0.000    -1.937415   -1.414336
------------------------------------------------------------------------------

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.343924   .1519244    13.14   0.000     2.064296    2.661431
------------------------------------------------------------------------------

Causal odds ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.772958    .123134     8.25   0.000     1.547325    2.031493
------------------------------------------------------------------------------

. 
. ivtsri y (x = z1 z2 z3) if _n <= 100, link(logit)

Final GMM criterion Q(b) =  1.04e-32

note: model is exactly identified

GMM estimation 

Number of parameters =   7
Number of moments    =   7
Initial weight matrix: Unadjusted                 Number of obs   =        100
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |    .820003   .3089263     2.65   0.008     .2145185    1.425487
    /s1xb_z2 |    1.41933   .3008394     4.72   0.000     .8296958    2.008964
    /s1xb_z3 |    .920567   .3021418     3.05   0.002       .32838    1.512754
         /a0 |  -.3875989   .3651993    -1.06   0.289    -1.103376    .3281786
         /b1 |   1.078734   .3247226     3.32   0.001     .4422894    1.715178
         /b2 |   .6217428   .3530592     1.76   0.078    -.0702404    1.313726
         /b0 |  -1.790935   .6476516    -2.77   0.006    -3.060309   -.5215611
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: x __000004 _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.940954   .9549941     3.32   0.001     1.556266    5.557667
------------------------------------------------------------------------------

Causal odds ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.862171   .6574564     1.76   0.078     .9321697    3.720009
------------------------------------------------------------------------------

. 
. ivtsri y w (x = z1 z2 z3), link(logit)

Final GMM criterion Q(b) =  3.21e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   9
Number of moments    =   9
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .8813906   .0655926    13.44   0.000     .7528315     1.00995
         /b2 |   .4189215   .0731088     5.73   0.000      .275631    .5622121
 /s2exogxb_w |   .9615452   .0879674    10.93   0.000     .7891322    1.133958
         /b0 |  -1.771829   .1332013   -13.30   0.000    -2.032899    -1.51076
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: x __000004 w _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.414255   .1583572    13.44   0.000     2.123003    2.745463
------------------------------------------------------------------------------

Causal odds ratio for: b2

 ( 1)  [b2]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.520321   .1111488     5.73   0.000     1.317362    1.754549
------------------------------------------------------------------------------

. 
. ivtsri y (x = z1 z2 z3), link(logit) estonly

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .8518266   .0605198    14.08   0.000       .73321    .9704431
    __000004 |   .5726491    .064993     8.81   0.000     .4452651    .7000331
       _cons |  -1.675875   .1247896   -13.43   0.000    -1.920458   -1.431292
------------------------------------------------------------------------------

. ivtsri

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .8518266   .0605198    14.08   0.000       .73321    .9704431
    __000004 |   .5726491    .064993     8.81   0.000     .4452651    .7000331
       _cons |  -1.675875   .1247896   -13.43   0.000    -1.920458   -1.431292
------------------------------------------------------------------------------

. 
. // check errors
. 
. rcof "noi ivtsri y w (x1 x2 = z1 z2 z3)" == 198
Currently, only 1 endogenous variable is allowed
invalid syntax

. 
end of do-file
      name:  ivtsri
       log:  /Users/tom/Documents/GitHub/onesamplemr-stata/cscripts/ivtsri.log
  log type:  text
 closed on:  10 Sep 2021, 08:20:00
-------------------------------------------------------------------------------
