-------------------------------------------------------------------------------
      name:  ivtsps
       log:  /Users/tom/Documents/GitHub/onesamplemr-stata/cscripts/ivtsps.log
  log type:  text
 opened on:  10 Sep 2021, 08:19:52

. // ivtsps cscript
. // 2021-09-06
. 
. cscript ivtsps adofiles ivtsps
-------------------------------------------------------------------BEGIN ivtsps

-> which ivtsps, usesysdir
/Users/tom/Documents/GitHub/onesamplemr-stata/ivtsps.ado
*! 1.0.0 Tom Palmer 05sep2021

. 
. // simulate data
. clear

. set obs 2500
number of observations (_N) was 0, now 2,500

. set seed 12345

. gen z1 = rbinomial(2, .2)

. gen z2 = rbinomial(2, .3)

. gen z3 = rbinomial(2, .4)

. gen u = rnormal()

. gen w = rnormal()

. gen x = z1 + z2 + z3 + w + u + rnormal()

. gen logitpy = -2 + x + w + u

. gen py = invlogit(logitpy)

. gen y = rbinomial(1, py)

. gen x1 = x

. gen x2 = rnormal()

. 
. // tests
. 
. // identity link
. 
. ivtsps y (x = z1 z2 z3)

Final GMM criterion Q(b) =  7.16e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

. ivtsps

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

. 
. ivtsps y (x = z1 z2 z3) if _n <= 50

Final GMM criterion Q(b) =  1.76e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =         50
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   1.060589   .3962486     2.68   0.007     .2839558    1.837222
    /s1xb_z2 |   1.148148   .3925519     2.92   0.003     .3787603    1.917535
    /s1xb_z3 |   1.403546   .3177779     4.42   0.000      .780713    2.026379
         /a0 |  -.5013724   .3595452    -1.39   0.163    -1.206068    .2033233
         /b1 |      .1713   .0290798     5.89   0.000     .1143046    .2282954
         /b0 |   .2434077   .0653369     3.73   0.000     .1153498    .3714656
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |      .1713   .0290798     5.89   0.000     .1143046    .2282954
------------------------------------------------------------------------------

. 
. ivtsps y (x = z1 z2 z3), link(identity)

Final GMM criterion Q(b) =  7.16e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .1070019   .0074424    14.38   0.000      .092415    .1215889
         /b0 |   .2879917   .0157401    18.30   0.000     .2571416    .3188417
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1070019   .0074424    14.38   0.000      .092415    .1215889
------------------------------------------------------------------------------

. 
. ivtsps y w (x = z1 z2 z3), link(identity)

Final GMM criterion Q(b) =  3.04e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   8
Number of moments    =   8
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .1052528   .0073427    14.33   0.000     .0908613    .1196442
 /s2exogxb_w |   .1160821   .0105911    10.96   0.000     .0953239    .1368403
         /b0 |   .2867508   .0150764    19.02   0.000     .2572016       .3163
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: __000004 w _cons

Causal risk difference for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1052528   .0073427    14.33   0.000     .0908613    .1196442
------------------------------------------------------------------------------

. 
. ivtsps y (x = z1 z2 z3), estonly

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .1070019   .0093533    11.44   0.000      .088661    .1253429
       _cons |   .2879917   .0196508    14.66   0.000     .2494581    .3265252
------------------------------------------------------------------------------

. ivtsps

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .1070019   .0093533    11.44   0.000      .088661    .1253429
       _cons |   .2879917   .0196508    14.66   0.000     .2494581    .3265252
------------------------------------------------------------------------------

. 
. // logadd link
. 
. cap noi {
. ivtsps y (x = z1 z2 z3), link(logadd)

Final GMM criterion Q(b) =  6.23e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .2130699   .0149322    14.27   0.000     .1838034    .2423364
         /b0 |  -1.141337   .0389282   -29.32   0.000    -1.217634   -1.065039
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.237471   .0184781    14.27   0.000      1.20178    1.274223
------------------------------------------------------------------------------
. ivtsps

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .2130699   .0149322    14.27   0.000     .1838034    .2423364
         /b0 |  -1.141337   .0389282   -29.32   0.000    -1.217634   -1.065039
------------------------------------------------------------------------------

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.237471   .0184781    14.27   0.000      1.20178    1.274223
------------------------------------------------------------------------------
. 
. ivtsps y (x = z1 z2 z3) if _n <= 200, link(logadd)

Final GMM criterion Q(b) =  7.98e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =        200
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |    .960665   .1863621     5.15   0.000      .595402    1.325928
    /s1xb_z2 |   1.017943   .1993872     5.11   0.000     .6271518    1.408735
    /s1xb_z3 |   1.105939   .1977604     5.59   0.000     .7183356    1.493542
         /a0 |  -.1036275   .2498245    -0.41   0.678    -.5932745    .3860195
         /b1 |   .2137135   .0426471     5.01   0.000     .1301268    .2973001
         /b0 |  -1.050832   .1150838    -9.13   0.000    -1.276393   -.8252724
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.238268   .0528085     5.01   0.000     1.138973    1.346219
------------------------------------------------------------------------------
. 
. ivtsps y w (x = z1 z2 z3), link(logadd)

Final GMM criterion Q(b) =  5.04e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   8
Number of moments    =   8
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .2040871   .0154347    13.22   0.000     .1738357    .2343385
 /s2exogxb_w |   .2436231   .0224021    10.87   0.000     .1997157    .2875304
         /b0 |   -1.23406    .039312   -31.39   0.000     -1.31111    -1.15701
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: __000004 w _cons

Causal risk ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.226405   .0189292    13.22   0.000      1.18986    1.264072
------------------------------------------------------------------------------
. 
. ivtsps y (x = z1 z2 z3), link(logadd) estonly

------------------------------------------------------------------------------
             |                 OIM
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .2130699   .0266058     8.01   0.000     .1609235    .2652164
       _cons |  -1.141337   .0620139   -18.40   0.000    -1.262881   -1.019792
------------------------------------------------------------------------------
. ivtsps

------------------------------------------------------------------------------
             |                 OIM
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .2130699   .0266058     8.01   0.000     .1609235    .2652164
       _cons |  -1.141337   .0620139   -18.40   0.000    -1.262881   -1.019792
------------------------------------------------------------------------------
. }

. 
. // logmult link
. 
. cap noi {
. ivtsps y (x = z1 z2 z3), link(logmult)
numerical derivatives are approximate
flat or discontinuous region encountered
numerical derivatives are approximate
flat or discontinuous region encountered
Hessian is not positive semidefinite
r(430);
. ivtsps
. 
. ivtsps y (x = z1 z2 z3) if _n <= 250, link(logmult)
. 
. ivtsps y w (x = z1 z2 z3), link(logmult)
. 
. ivtsps y (x = z1 z2 z3), link(logmult) estonly
. ivtsps
. }

. 
. // logit link
. 
. ivtsps y (x = z1 z2 z3), link(logit)

Final GMM criterion Q(b) =  3.41e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .4488332   .0346899    12.94   0.000     .3808424    .5168241
         /b0 |  -.8868145   .0715273   -12.40   0.000    -1.027006   -.7466235
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.566483   .0543411    12.94   0.000     1.463517    1.676694
------------------------------------------------------------------------------

. ivtsps

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9945859   .0614877    16.18   0.000     .8740722      1.1151
    /s1xb_z2 |   .9540576   .0525572    18.15   0.000     .8510474    1.057068
    /s1xb_z3 |   .9554229   .0495052    19.30   0.000     .8583944    1.052451
         /a0 |   .0842244   .0675928     1.25   0.213    -.0482551    .2167039
         /b1 |   .4488332   .0346899    12.94   0.000     .3808424    .5168241
         /b0 |  -.8868145   .0715273   -12.40   0.000    -1.027006   -.7466235
------------------------------------------------------------------------------

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.566483   .0543411    12.94   0.000     1.463517    1.676694
------------------------------------------------------------------------------

. 
. ivtsps y (x = z1 z2 z3) if _n <= 100, link(logit)

Final GMM criterion Q(b) =  2.11e-32

note: model is exactly identified

GMM estimation 

Number of parameters =   6
Number of moments    =   6
Initial weight matrix: Unadjusted                 Number of obs   =        100
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |    .820003   .3089263     2.65   0.008     .2145185    1.425487
    /s1xb_z2 |    1.41933   .3008394     4.72   0.000     .8296958    2.008964
    /s1xb_z3 |    .920567   .3021418     3.05   0.002       .32838    1.512754
         /a0 |  -.3875989   .3651993    -1.06   0.289    -1.103376    .3281786
         /b1 |   .5496075   .1497189     3.67   0.000     .2561639    .8430511
         /b0 |  -.9312614    .276238    -3.37   0.001    -1.472678   -.3898448
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 _cons
Instruments for equation 2: __000004 _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.732573   .2593988     3.67   0.000     1.291965    2.323445
------------------------------------------------------------------------------

. 
. ivtsps y w (x = z1 z2 z3), link(logit)

Final GMM criterion Q(b) =  2.67e-33

note: model is exactly identified

GMM estimation 

Number of parameters =   8
Number of moments    =   8
Initial weight matrix: Unadjusted                 Number of obs   =      2,500
GMM weight matrix:     Robust

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    /s1xb_z1 |   .9882395   .0505573    19.55   0.000     .8891491     1.08733
    /s1xb_z2 |   .9152859   .0431149    21.23   0.000     .8307823    .9997895
    /s1xb_z3 |    .954388   .0404106    23.62   0.000     .8751847    1.033591
     /s1xb_w |   .9801363    .027334    35.86   0.000     .9265627     1.03371
         /a0 |   .0734396   .0541988     1.36   0.175    -.0327882    .1796673
         /b1 |   .5740639   .0434765    13.20   0.000     .4888515    .6592762
 /s2exogxb_w |   .6330367   .0597833    10.59   0.000     .5158637    .7502098
         /b0 |  -1.149458   .0870355   -13.21   0.000    -1.320045   -.9788718
------------------------------------------------------------------------------
Instruments for equation 1: z1 z2 z3 w _cons
Instruments for equation 2: __000004 w _cons

Causal odds ratio for: b1

 ( 1)  [b1]_cons = 0

------------------------------------------------------------------------------
             |     exp(b)   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.775468   .0771911    13.20   0.000     1.630443    1.933392
------------------------------------------------------------------------------

. 
. ivtsps y (x = z1 z2 z3), link(logit) estonly

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .4488332   .0412018    10.89   0.000     .3680791    .5295873
       _cons |  -.8868145   .0855778   -10.36   0.000    -1.054544   -.7190852
------------------------------------------------------------------------------

. ivtsps

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    __000004 |   .4488332   .0412018    10.89   0.000     .3680791    .5295873
       _cons |  -.8868145   .0855778   -10.36   0.000    -1.054544   -.7190852
------------------------------------------------------------------------------

. 
. // check errors
. 
. rcof "noi ivtsps y w (x1 x2 = z1 z2 z3)" == 198
Currently, only 1 endogenous variable is allowed
invalid syntax

. 
end of do-file
      name:  ivtsps
       log:  /Users/tom/Documents/GitHub/onesamplemr-stata/cscripts/ivtsps.log
  log type:  text
 closed on:  10 Sep 2021, 08:19:54
-------------------------------------------------------------------------------
